In [1]:
import pandas as pd, numpy as np

In [2]:
df = pd.read_csv('forked_Bigdata_Analyst_Cert/part4/ch7/air_quality.csv')
df

     Ozone  Solar.R  Wind  Temp  Month  Day
0     41.0    190.0   7.4    67      5    1
1     36.0    118.0   8.0    72      5    2
2     12.0    149.0  12.6    74      5    3
3     18.0    313.0  11.5    62      5    4
4      NaN      NaN  14.3    56      5    5
..     ...      ...   ...   ...    ...  ...
148   30.0    193.0   6.9    70      9   26
149    NaN    145.0  13.2    77      9   27
150   14.0    191.0  14.3    75      9   28
151   18.0    131.0   8.0    76      9   29
152   20.0    223.0  11.5    68      9   30

[153 rows x 6 columns]

In [3]:
df['Month'].value_counts()

Month
5    31
7    31
8    31
6    30
9    30
Name: count, dtype: int64

In [4]:
df['Ozone'].describe()

count    116.000000
mean      42.129310
std       32.987885
min        1.000000
25%       18.000000
50%       31.500000
75%       63.250000
max      168.000000
Name: Ozone, dtype: float64

In [5]:
pd.crosstab(df['Month'], df['Day'])

Day,1,2,3,4,5,6,7,8,9,10,...,22,23,24,25,26,27,28,29,30,31
Month,,,,,,,,,,,,,,,,,,,,,
5,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
6,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,0
7,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
8,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,1
9,1,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,1,1,1,1,0

In [6]:
df.groupby('Month')['Ozone'].mean()

Month
5    23.615385
6    29.444444
7    59.115385
8    59.961538
9    31.448276
Name: Ozone, dtype: float64

# NAs

## Detecting NAs

### isna(), isnull() : 같은 기능. notna/notnull은 그 역.

In [10]:
df['Ozone'].isna(), df['Ozone'].isnull()

(0      False
 1      False
 2      False
 3      False
 4       True
        ...
 148    False
 149     True
 150    False
 151    False
 152    False
 Name: Ozone, Length: 153, dtype: bool,
 0      False
 1      False
 2      False
 3      False
 4       True
        ...
 148    False
 149     True
 150    False
 151    False
 152    False
 Name: Ozone, Length: 153, dtype: bool)

In [12]:
df.isna(), df.isnull()

(     Ozone  Solar.R   Wind   Temp  Month    Day
 0    False    False  False  False  False  False
 1    False    False  False  False  False  False
 2    False    False  False  False  False  False
 3    False    False  False  False  False  False
 4     True     True  False  False  False  False
 ..     ...      ...    ...    ...    ...    ...
 148  False    False  False  False  False  False
 149   True    False  False  False  False  False
 150  False    False  False  False  False  False
 151  False    False  False  False  False  False
 152  False    False  False  False  False  False

 [153 rows x 6 columns],
      Ozone  Solar.R   Wind   Temp  Month    Day
 0    False    False  False  False  False  False
 1    False    False  False  False  False  False
 2    False    False  False  False  False  False
 3    False    False  False  False  False  False
 4     True     True  False  False  False  False
 ..     ...      ...    ...    ...    ...    ...
 148  False    False  False  False  False  False
 149   True    False  False  False  False  False
 150  False    False  False  False  False  False
 151  False    False  False  False  False  False
 152  False    False  False  False  False  False

 [153 rows x 6 columns])

## Processing NAs

### df.dropna() : drop NAs

In [29]:
#axis = 0 or 'index' vs. 1 or 'columns'
df.dropna(axis = 'columns'), df.dropna(axis = 'columns').shape

(     Wind  Temp  Month  Day
 0     7.4    67      5    1
 1     8.0    72      5    2
 2    12.6    74      5    3
 3    11.5    62      5    4
 4    14.3    56      5    5
 ..    ...   ...    ...  ...
 148   6.9    70      9   26
 149  13.2    77      9   27
 150  14.3    75      9   28
 151   8.0    76      9   29
 152  11.5    68      9   30

 [153 rows x 4 columns],
 (153, 4))

In [30]:
#subset = [] option to ignore other columns
df.dropna(subset = ['Ozone'], how = 'any'), df.dropna(subset = ['Ozone'], how = 'any').shape

(     Ozone  Solar.R  Wind  Temp  Month  Day
 0     41.0    190.0   7.4    67      5    1
 1     36.0    118.0   8.0    72      5    2
 2     12.0    149.0  12.6    74      5    3
 3     18.0    313.0  11.5    62      5    4
 5     28.0      NaN  14.9    66      5    6
 ..     ...      ...   ...   ...    ...  ...
 147   14.0     20.0  16.6    63      9   25
 148   30.0    193.0   6.9    70      9   26
 150   14.0    191.0  14.3    75      9   28
 151   18.0    131.0   8.0    76      9   29
 152   20.0    223.0  11.5    68      9   30

 [116 rows x 6 columns],
 (116, 6))

### df.fillna() : replace NAs with other values

In [28]:
df.fillna(df.mean())

        Ozone     Solar.R  Wind  Temp  Month  Day
0    41.00000  190.000000   7.4    67      5    1
1    36.00000  118.000000   8.0    72      5    2
2    12.00000  149.000000  12.6    74      5    3
3    18.00000  313.000000  11.5    62      5    4
4    42.12931  185.931507  14.3    56      5    5
..        ...         ...   ...   ...    ...  ...
148  30.00000  193.000000   6.9    70      9   26
149  42.12931  145.000000  13.2    77      9   27
150  14.00000  191.000000  14.3    75      9   28
151  18.00000  131.000000   8.0    76      9   29
152  20.00000  223.000000  11.5    68      9   30

[153 rows x 6 columns]

In [31]:
df.fillna(df.mean()).isna().sum()

Ozone      0
Solar.R    0
Wind       0
Temp       0
Month      0
Day        0
dtype: int64

## Visualization by matplotlib

In [1]:
import matplotlib.pyplot as plt

## Visualization by seaborn